# ElementsWillBeDeletedNoOption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..ElementsWillBeDeletedNoOption Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
Elements will be deleted
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementsWillBeDeletedNoOption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementsWillBeDeletedNoOption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementsWillBeDeletedNoOption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace